/**
* @ brief      测试scanf一次输出多个值
* @ author     mculover666
* @ date       2019年6月25日11:30:14
* @ encoding   GBK/GB2312
*/

#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    int i = 0, j = 0;

    printf("请输入i的值和j的值(整数):");
    scanf("%d %d", &i, &j);
    printf("i = %d j = %d\n", i, j);

    system("pause");
    return 0;
}

/*
    在Mingw-w64编译后运行结果：
    测试结果1：
    ------------------------------------
    请输入i的值和j的值(整数):1 2
    i = 1 j = 2
    请按任意键继续. . .
    ------------------------------------

    测试结果2：
    ------------------------------------
    请输入i的值和j的值(整数):1
    2
    i = 1 j = 2
    请按任意键继续. . .
    ------------------------------------
*/

