/**
 * @ brief      指针和二维数组
 * @ author     mculover666
 * @ date       2019年7月2日12:21:49
 * @ encoding   GBK/GB2312
*/
#include <stdio.h>
#include <stdlib.h>

int main(void)
{
    int a[3][4] = {
        {1,2,3,4},
        {5,6,7,8},
        {9,10,11,12}
    };
    
    printf("a = %#X &a[0] = %#X a[0] = %#X &a[0][0] = %#X\n",a, &a[0], a[0], &a[0][0]);

    //a[0][0]
    printf("a[0][0] = %d\n", a[0][0]);
    printf("*(a[0]) = %d\n", *(a[0]));
    printf("**(a) = %d\n", **(a));

    //a[2][0]
    printf("a[2][0] = %d\n", a[2][0]);
    printf("*(a[2]) = %d\n", *(a[2]));
    printf("**(a+2) = %d\n", **(a+2));

    //a[2][2]
    printf("a[2][2] = %d\n", a[2][2]);
    printf("*(a[2] + 2) = %d\n", *(a[2] + 2));
    printf("*(*(a+2) + 2) = %d\n", *(*(a+2) + 2));    

    system("pause");
    return 0;
}
/**
    在Mingw-w64编译后运行结果：
    ------------------------------------
    a = 0X61FDF0 &a[0] = 0X61FDF0 a[0] = 0X61FDF0 &a[0][0] = 0X61FDF0
    a[0][0] = 1
    *(a[0]) = 1
    **(a) = 1
    a[2][0] = 9
    *(a[2]) = 9
    **(a+2) = 9
    a[2][2] = 11
    *(a[2] + 2) = 11
    *(*(a+2) + 2) = 11
    请按任意键继续. . .
    ------------------------------------
 */